app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "ashah"], ["email", "asha15@gmail.com"], ["password", "11111111"], ["created_at", "2019-11-18 19:46:09.218046"], ["updated_at", "2019-11-18 19:46:09.218046"]]
---
	def create
		  @user = User.new(user_params)
      if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "sylviano"], ["password", "111111"], ["updated_at", "2019-11-25 17:28:20.601696"], ["id", 3]]
---
	def update
		@user = User.find(params[:id])
    if @user.update_attributes(user_params)